OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_define_MS51_32K_IAR.h
#define    ENABLE_SC0_AUTO_CONVENTION_ERROR_INTERRUPT    SFRS=2;SC0IE|=0x10;SFRS=0
#define    ENABLE_SC0_BLOCK_GUARD_TIMER_INTERRUPT        SFRS=2;SC0IE|=0x08;SFRS=0
#define    ENABLE_SC0_TRANSFER_ERROR_INTERRUPT           SFRS=2;SC0IE|=0x04;SFRS=0
#define    ENABLE_SC0_TRASMIT_BUFFER_EMPTY_INTERRUPT     SFRS=2;SC0IE|=0x02;SFRS=0
#define    ENABLE_SC0_RECEIVE_DATA_REACH_INTERRUPT       SFRS=2;SC0IE|=0x01;SFRS=0

#define    ENABLE_SC1_AUTO_CONVENTION_ERROR_INTERRUPT    SFRS=2;SC1IE|=0x10;SFRS=0
#define    ENABLE_SC1_BLOCK_GUARD_TIMER_INTERRUPT        SFRS=2;SC1IE|=0x08;SFRS=0
#define    ENABLE_SC1_TRANSFER_ERROR_INTERRUPT           SFRS=2;SC1IE|=0x04;SFRS=0
#define    ENABLE_SC1_TRASMIT_BUFFER_EMPTY_INTERRUPT     SFRS=2;SC1IE|=0x02;SFRS=0
#define    ENABLE_SC1_RECEIVE_DATA_REACH_INTERRUPT       SFRS=2;SC1IE|=0x01;SFRS=0

#define    ENABLE_SC2_AUTO_CONVENTION_ERROR_INTERRUPT    SFRS=2;SC2IE|=0x10;SFRS=0
#define    ENABLE_SC2_BLOCK_GUARD_TIMER_INTERRUPT        SFRS=2;SC2IE|=0x08;SFRS=0
#define    ENABLE_SC2_TRANSFER_ERROR_INTERRUPT           SFRS=2;SC2IE|=0x04;SFRS=0
#define    ENABLE_SC2_TRASMIT_BUFFER_EMPTY_INTERRUPT     SFRS=2;SC2IE|=0x02;SFRS=0
#define    ENABLE_SC2_RECEIVE_DATA_REACH_INTERRUPT       SFRS=2;SC2IE|=0x01;SFRS=0

/*DISABLE INTERRUPT*/ 
#define    DISABLE_ADC_INTERRUPT         clr_IE_EADC
#define    DISABLE_BOD_INTERRUPT         clr_IE_EBOD
#define    DISABLE_UART0_INTERRUPT       clr_IE_ES
#define    DISABLE_TIMER1_INTERRUPT      clr_IE_ET1 
#define    DISABLE_INT1_INTERRUPT        clr_IE_EX1 
#define    DISABLE_TIMER0_INTERRUPT      clr_IE_ET0 
#define    DISABLE_INT0_INTERRUPT        clr_IE_EX0

//ERROR EIE0 -> EIE
#define    DISABLE_TIMER2_INTERRUPT      clr_EIE_ET2         //clr_EIE0_ET2 
#define    DISABLE_SPI0_INTERRUPT        clr_EIE_ESPI        //clr_EIE0_ESPI 
#define    DISABLE_PWM0_FB_INTERRUPT     clr_EIE_EFB         //clr_EIE0_EFB  
#define    DISABLE_WDT_INTERRUPT         clr_EIE_EWDT        //clr_EIE0_EWDT  
#define    DISABLE_PWM0_INTERRUPT        clr_EIE_EPWM0       //clr_EIE0_EPWM0  
#define    DISABLE_CAPTURE_INTERRUPT     clr_EIE_ECAP        //clr_EIE0_ECAP 
#define    DISABLE_PIN_INTERRUPT         clr_EIE_EPI         //clr_EIE0_EPI  
#define    DISABLE_I2C_INTERRUPT         clr_EIE_EI2C        //clr_EIE0_EI2C
          
#define    DISABLE_PWM3_INTERRUPT        clr_EIE1_EPWM3
#define    DISABLE_PWM2_INTERRUPT        clr_EIE1_EPWM2
#define    DISABLE_PWM1_INTERRUPT        clr_EIE1_EPWM1
#define    DISABLE_WKT_INTERRUPT         clr_EIE1_EWKT 
#define    DISABLE_TIMER3_INTERRUPT      clr_EIE1_ET3
#define    DISABLE_UART1_INTERRUPT       clr_EIE1_ES_1 

#define    DISABLE_SC0_AUTO_CONVENTION_ERROR_INTERRUPT    SFRS=2;SC0IE&=0xEF;SFRS=0
#define    DISABLE_SC0_BLOCK_GUARD_TIMER_INTERRUPT        SFRS=2;SC0IE&=0xF7;SFRS=0
#define    DISABLE_SC0_TRANSFER_ERROR_INTERRUPT           SFRS=2;SC0IE&=0xFB;SFRS=0
#define    DISABLE_SC0_TRASMIT_BUFFER_EMPTY_INTERRUPT     SFRS=2;SC0IE&=0xFD;SFRS=0
#define    DISABLE_SC0_RECEIVE_DATA_REACH_INTERRUPT       SFRS=2;SC0IE&=0xFE;SFRS=0

#define    DISABLE_SC1_AUTO_CONVENTION_ERROR_INTERRUPT    SFRS=2;SC1IE&=0xEF;SFRS=0
#define    DISABLE_SC1_BLOCK_GUARD_TIMER_INTERRUPT        SFRS=2;SC1IE&=0xF7;SFRS=0
#define    DISABLE_SC1_TRANSFER_ERROR_INTERRUPT           SFRS=2;SC1IE&=0xFB;SFRS=0
#define    DISABLE_SC1_TRASMIT_BUFFER_EMPTY_INTERRUPT     SFRS=2;SC1IE&=0xFD;SFRS=0
#define    DISABLE_SC1_RECEIVE_DATA_REACH_INTERRUPT       SFRS=2;SC1IE&=0xFE;SFRS=0

#define    DISABLE_SC2_AUTO_CONVENTION_ERROR_INTERRUPT    SFRS=2;SC2IE&=0xEF;SFRS=0
#define    DISABLE_SC2_BLOCK_GUARD_TIMER_INTERRUPT        SFRS=2;SC2IE&=0xF7;SFRS=0
#define    DISABLE_SC2_TRANSFER_ERROR_INTERRUPT           SFRS=2;SC2IE&=0xFB;SFRS=0
#define    DISABLE_SC2_TRASMIT_BUFFER_EMPTY_INTERRUPT     SFRS=2;SC2IE&=0xFD;SFRS=0
#define    DISABLE_SC2_RECEIVE_DATA_REACH_INTERRUPT       SFRS=2;SC2IE&=0xFE;SFRS=0

/* Setting Interrupt Priority */
#define   SET_INT_INT0_LEVEL0          clr_IP_PX0; clr_IPH_PX0H
#define   SET_INT_INT0_LEVEL1          clr_IP_PX0; set_IPH_PX0H
#define   SET_INT_INT0_LEVEL2          set_IP_PX0; clr_IPH_PX0H
#define   SET_INT_INT0_LEVEL3          set_IP_PX0; set_IPH_PX0H

#define   SET_INT_BOD_LEVEL0           clr_IP_PBOD; clr_IPH_PBODH
#define   SET_INT_BOD_LEVEL1           clr_IP_PBOD; set_IPH_PBODH
#define   SET_INT_BOD_LEVEL2           set_IP_PBOD; clr_IPH_PBODH
#define   SET_INT_BOD_LEVEL3           set_IP_PBOD; set_IPH_PBODH

#define   SET_INT_WDT_LEVEL0           clr_EIP_PWDT; clr_EIPH_PWDTH
#define   SET_INT_WDT_LEVEL1           clr_EIP_PWDT; set_EIPH_PWDTH
#define   SET_INT_WDT_LEVEL2           set_EIP_PWDT; clr_EIPH_PWDTH
#define   SET_INT_WDT_LEVEL3           set_EIP_PWDT; set_EIPH_PWDTH

#define   SET_INT_TIMER0_LEVEL0        clr_IP_PT0; clr_IPH_PT0H
#define   SET_INT_TIMER0_LEVEL1        clr_IP_PT0; set_IPH_PT0H
#define   SET_INT_TIMER0_LEVEL2        set_IP_PT0; clr_IPH_PT0H
#define   SET_INT_TIMER0_LEVEL3        set_IP_PT0; set_IPH_PT0H

#define   SET_INT_I2C0_LEVEL0          clr_EIP_PI2C; clr_EIPH_PI2CH
#define   SET_INT_I2C0_LEVEL1          clr_EIP_PI2C; set_EIPH_PI2CH
#define   SET_INT_I2C0_LEVEL2          set_EIP_PI2C; clr_EIPH_PI2CH
#define   SET_INT_I2C0_LEVEL3          set_EIP_PI2C; set_EIPH_PI2CH

#define   SET_INT_ADC_LEVEL0           clr_IP_PADC; clr_IPH_PADCH
#define   SET_INT_ADC_LEVEL1           clr_IP_PADC; set_IPH_PADCH
#define   SET_INT_ADC_LEVEL2           set_IP_PADC; clr_IPH_PADCH
#define   SET_INT_ADC_LEVEL3           set_IP_PADC; set_IPH_PADCH

#define   SET_INT_INT1_LEVEL0          clr_IP_PX1; clr_IPH_PX1H
#define   SET_INT_INT1_LEVEL1          clr_IP_PX1; set_IPH_PX1H
#define   SET_INT_INT1_LEVEL2          set_IP_PX1; clr_IPH_PX1H
#define   SET_INT_INT1_LEVEL3          set_IP_PX1; set_IPH_PX1H

#define   SET_INT_PIT_LEVEL0           clr_EIP_PPI; clr_EIPH_PPIH
#define   SET_INT_PIT_LEVEL1           clr_EIP_PPI; set_EIPH_PPIH
#define   SET_INT_PIT_LEVEL2           set_EIP_PPI; clr_EIPH_PPIH
#define   SET_INT_PIT_LEVEL3           set_EIP_PPI; set_EIPH_PPIH

