OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_define_MS51_32K_IAR.h
#define   SET_INT_Timer1_LEVEL0        clr_IP_PT1; clr_IPH_PT1H
#define   SET_INT_Timer1_LEVEL1        clr_IP_PT1; set_IPH_PT1H
#define   SET_INT_Timer1_LEVEL2        set_IP_PT1; clr_IPH_PT1H
#define   SET_INT_Timer1_LEVEL3        set_IP_PT1; set_IPH_PT1H

#define   SET_INT_UART0_LEVEL0         clr_IP_PS; clr_IPH_PSH
#define   SET_INT_UART0_LEVEL1         clr_IP_PS; set_IPH_PSH
#define   SET_INT_UART0_LEVEL2         set_IP_PS; clr_IPH_PSH
#define   SET_INT_UART0_LEVEL3         set_IP_PS; set_IPH_PSH

#define   SET_INT_PWM0_BRAKE_LEVEL0    clr_EIP_PFB; clr_EIPH_PFBH
#define   SET_INT_PWM0_BRAKE_LEVEL1    clr_EIP_PFB; set_EIPH_PFBH
#define   SET_INT_PWM0_BRAKE_LEVEL2    set_EIP_PFB; clr_EIPH_PFBH
#define   SET_INT_PWM0_BRAKE_LEVEL3    set_EIP_PFB; set_EIPH_PFBH

#define   SET_INT_SPI_LEVEL0           clr_EIP_PSPI; clr_EIPH_PSPIH
#define   SET_INT_SPI_LEVEL1           clr_EIP_PSPI; set_EIPH_PSPIH
#define   SET_INT_SPI_LEVEL2           set_EIP_PSPI; clr_EIPH_PSPIH
#define   SET_INT_SPI_LEVEL3           set_EIP_PSPI; set_EIPH_PSPIH

#define   SET_INT_Timer2_LEVEL0        clr_EIP_PT2; clr_EIPH_PT2H
#define   SET_INT_Timer2_LEVEL1        clr_EIP_PT2; set_EIPH_PT2H
#define   SET_INT_Timer2_LEVEL2        set_EIP_PT2; clr_EIPH_PT2H
#define   SET_INT_Timer2_LEVEL3        set_EIP_PT2; set_EIPH_PT2H

#define   SET_INT_CAPTURE_LEVEL0       clr_EIP_PCAP; clr_EIPH_PCAPH
#define   SET_INT_Capture_LEVEL1       clr_EIP_PCAP; set_EIPH_PCAPH
#define   SET_INT_Capture_LEVEL2       set_EIP_PCAP; clr_EIPH_PCAPH
#define   SET_INT_Capture_LEVEL3       set_EIP_PCAP; set_EIPH_PCAPH

#define   SET_INT_PWM_LEVEL0           clr_EIP_PPWM; clr_EIPH_PPWMH
#define   SET_INT_PWM_LEVEL1           clr_EIP_PPWM; set_EIPH_PPWMH
#define   SET_INT_PWM_LEVEL2           set_EIP_PPWM; clr_EIPH_PPWMH
#define   SET_INT_PWM_LEVEL3           set_EIP_PPWM; set_EIPH_PPWMH

#define   SET_INT_UART1_LEVEL0         clr_EIP1_PS_1; clr_EIPH1_PSH_1
#define   SET_INT_UART1_LEVEL1         clr_EIP1_PS_1; set_EIPH1_PSH_1
#define   SET_INT_UART1_LEVEL2         set_EIP1_PS_1; clr_EIPH1_PSH_1
#define   SET_INT_UART1_LEVEL3         set_EIP1_PS_1; set_EIPH1_PSH_1

#define   SET_INT_Timer3_LEVEL0        clr_EIP1_PT3; clr_EIPH1_PT3H
#define   SET_INT_Timer3_LEVEL1        clr_EIP1_PT3; set_EIPH1_PT3H
#define   SET_INT_Timer3_LEVEL2        set_EIP1_PT3; clr_EIPH1_PT3H
#define   SET_INT_Timer3_LEVEL3        set_EIP1_PT3; set_EIPH1_PT3H

#define   SET_INT_WKT_LEVEL0           clr_EIP1_PWKT; clr_EIPH1_PWKTH
#define   SET_INT_WKT_LEVEL1           clr_EIP1_PWKT; set_EIPH1_PWKTH
#define   SET_INT_WKT_LEVEL2           set_EIP1_PWKT; clr_EIPH1_PWKTH
#define   SET_INT_WKT_LEVEL3           set_EIP1_PWKT; set_EIPH1_PWKTH

/* Clear Interrupt Flag */
#define    CLEAR_ADC_INTERRUPT_FLAG          clr_ADCCON0_ADCF
#define    CLEAR_BOD_INTERRUPT_FLAG          clr_BODCON0_BOF
#define    CLEAR_BOD_RESET_FLAG              clr_BODCON0_BORF
#define    CLEAR_UART0_INTERRUPT_TX_FLAG     clr_SCON_TI
#define    CLEAR_UART0_INTERRUPT_RX_FLAG     clr_SCON_RI
#define    CLEAR_TIMER1_INTERRUPT_FLAG       clr_TCON_TF1
#define    CLEAR_INT1_INTERRUPT_FLAG         clr_TCON_IE1
#define    CLEAR_TIMER0_INTERRUPT_FLAG       clr_TCON_TF0
#define    CLEAR_INT0_INTERRUPT_FLAG         clr_TCON_IE0
#define    CLEAR_TIMER2_INTERRUPT_FLAG       clr_T2CON_TF2
#define    CLEAR_SPI0_INTERRUPT_FLAG         clr_SPSR_SPIF
#define    CLEAR_PWM0_FB_INTERRUPT_FLAG      clr_PWM0FBD_FBF
#define    CLEAR_WDT_INTERRUPT_FLAG          clr_WKCON_WKTF
#define    CLEAR_PWM0_INTERRUPT_FLAG         clr_PWM1CON0_PWMF
#define    CLEAR_CAPTURE_INTERRUPT_IC0_FLAG  clr_CAPCON0_CAPF0
#define    CLEAR_CAPTURE_INTERRUPT_IC1_FLAG  clr_CAPCON0_CAPF1
#define    CLEAR_CAPTURE_INTERRUPT_IC2_FLAG  clr_CAPCON0_CAPF2
#define    CLEAR_PIN_INTERRUPT_PIT0_FLAG     clr_PIF_PIF0
#define    CLEAR_PIN_INTERRUPT_PIT1_FLAG     clr_PIF_PIF1
#define    CLEAR_PIN_INTERRUPT_PIT2_FLAG     clr_PIF_PIF2
#define    CLEAR_PIN_INTERRUPT_PIT3_FLAG     clr_PIF_PIF3
#define    CLEAR_PIN_INTERRUPT_PIT4_FLAG     clr_PIF_PIF4
#define    CLEAR_PIN_INTERRUPT_PIT5_FLAG     clr_PIF_PIF5
#define    CLEAR_PIN_INTERRUPT_PIT6_FLAG     clr_PIF_PIF6
#define    CLEAR_PIN_INTERRUPT_PIT7_FLAG     clr_PIF_PIF7
#define    CLEAR_I2C_TIMEOUT_INTERRUPT_FLAG  clr_I2TOC_I2TOF
#define    CLEAR_WKT_INTERRUPT_FLAG          clr_WKCON_WKTF
#define    CLEAR_TIMER3_INTERRUPT_FLAG       clr_T3CON_TF3
#define    CLEAR_UART1_INTERRUPT_FLAG        clr_EIE1_ES_1 
/****************************************************************************************************************/
/* Define TIMER VALUE setting is base on name with Fsys value                                                    */
/****************************************************************************************************************/
/* define timer base value Fsys = 16MHz */
#define    TIMER_DIV12_VALUE_10us_FOSC_160000       65535-8        //13*12/16000000 = 10 uS,        // Timer divider = 12 for TM0/TM1 
#define    TIMER_DIV12_VALUE_100us_FOSC_160000      65535-130      //130*12/16000000 = 10 uS,       // Timer divider = 12            
#define    TIMER_DIV12_VALUE_1ms_FOSC_160000        65535-1334     //1334*12/16000000 = 1 mS,       // Timer divider = 12          
#define    TIMER_DIV12_VALUE_10ms_FOSC_160000       65535-13334    //13334*12/16000000 = 10 mS      // Timer divider = 12          
#define    TIMER_DIV12_VALUE_40ms_FOSC_160000       65535-53336    //53336*12/16000000 = 40 ms      // Timer divider = 12         
#define    TIMER_DIV4_VALUE_10us_FOSC_160000        65535-30       //40*4/16000000 = 10 uS,         // Timer divider = 4  for TM2/TM3 
#define    TIMER_DIV4_VALUE_100us_FOSC_160000       65535-400      //400*4/16000000 = 100 us        // Timer divider = 4            
#define    TIMER_DIV4_VALUE_200us_FOSC_160000       65535-800      //800*4/16000000 = 200 us        // Timer divider = 4            
#define    TIMER_DIV4_VALUE_416us_FOSC_160000       65535-1650
#define    TIMER_DIV4_VALUE_500us_FOSC_160000       65535-2000     //2000*4/16000000 = 500 us       // Timer divider = 4            
#define    TIMER_DIV4_VALUE_1ms_FOSC_160000         65535-4000     //4000*4/16000000 = 1 mS,        // Timer divider = 4            
#define    TIMER_DIV4_VALUE_10ms_FOSC_160000        65535-40000    //40000*4/16000000 = 10 mS,      // Timer divider = 4         
#define    TIMER_DIV16_VALUE_10ms_FOSC_160000       65535-10000    //10000*16/16000000 = 10 ms      // Timer  divider = 16        
#define    TIMER_DIV64_VALUE_30ms_FOSC_160000       65535-7500     //7500*64/16000000 = 30 ms       // Timer divider = 64           
#define    TIMER_DIV128_VALUE_1ms_FOSC_160000       65535-125      //125*128/16000000 = 1 ms        // Timer divider = 128            
#define    TIMER_DIV128_VALUE_10ms_FOSC_160000      65535-1250     //1250*128/16000000 = 10 ms      // Timer divider = 128           
#define    TIMER_DIV128_VALUE_100ms_FOSC_160000     65535-12500    //12500*128/16000000 = 100 ms    // Timer divider = 128        
#define    TIMER_DIV128_VALUE_200ms_FOSC_160000     65535-25000    //25000*128/16000000 = 200 ms    // Timer divider = 128        
#define    TIMER_DIV256_VALUE_500ms_FOSC_160000     65535-31250    //31250*256/16000000 = 500 ms    // Timer divider = 256         
#define    TIMER_DIV512_VALUE_100ms_FOSC_160000     65535-3125     //3125*512/16000000 = 100ms.     // Timer Divider = 512        
#define    TIMER_DIV512_VALUE_1s_FOSC_160000        65535-31250    //31250*512/16000000 = 1 s.      // Timer Divider = 512        

/* define timer base value Fsys = 16.6MHz */
#define    TIMER_DIV12_VALUE_10us_FOSC_166000       65535-14       //14*12/16600000 = 10 uS,        // Timer divider = 12 for TM0/TM1
#define    TIMER_DIV12_VALUE_100us_FOSC_166000      65535-138      //138*12/16600000 = 100 uS,      // Timer divider = 12           
#define    TIMER_DIV12_VALUE_1ms_FOSC_166000        65535-1384     //1384*12/16600000 = 1 mS,       // Timer divider = 12            
#define    TIMER_DIV12_VALUE_10ms_FOSC_166000       65535-13834    //13834*12/16600000 = 10 mS      // Timer divider = 12            
#define    TIMER_DIV12_VALUE_40ms_FOSC_166000       65535-55333    //55333*12/16600000 = 40 ms      // Timer divider = 12           
#define    TIMER_DIV4_VALUE_10us_FOSC_166000        65535-41       //41*4/16600000 = 10 uS,         // Timer divider = 4  for TM2/TM3 
#define    TIMER_DIV4_VALUE_100us_FOSC_166000       65535-415      //415*4/16600000 = 100 us        // Timer divider = 4            
#define    TIMER_DIV4_VALUE_200us_FOSC_166000       65535-830      //830*4/16600000 = 200 us        // Timer divider = 4            
#define    TIMER_DIV4_VALUE_500us_FOSC_166000       65535-2075     //2075*4/16600000 = 500 us       // Timer divider = 4              
#define    TIMER_DIV4_VALUE_1ms_FOSC_166000         65535-4150     //4150*4/16600000 = 1 mS,        // Timer divider = 4              
#define    TIMER_DIV16_VALUE_10ms_FOSC_166000       65535-10375    //10375*16/16600000 = 10 ms      // Timer  divider = 16          
#define    TIMER_DIV64_VALUE_30ms_FOSC_166000       65535-7781     //7781*64/16600000 = 30 ms       // Timer divider = 64             
#define    TIMER_DIV128_VALUE_100ms_FOSC_166000     65535-12969    //12969*128/16600000 = 100 ms    // Timer divider = 128          
#define    TIMER_DIV128_VALUE_200ms_FOSC_166000     65535-25937    //25937*128/16600000 = 200 ms    // Timer divider = 128          
#define    TIMER_DIV256_VALUE_500ms_FOSC_166000     65535-32422    //32422*256/16600000 = 500 ms    // Timer divider = 256           
#define    TIMER_DIV512_VALUE_1s_FOSC_166000        65535-32421    //32421*512/16600000 = 1 s.      // Timer Divider = 512          
/* define timer base value Fsys = 24 MHz*/
#define    TIMER_DIV12_VALUE_10us_FOSC_240000       65535-20       //20*12/24000000 = 10 uS,        // Timer divider = 12        
#define    TIMER_DIV12_VALUE_100us_FOSC_240000      65535-200      //130*12/16000000 = 10 uS,       // Timer divider = 12        
#define    TIMER_DIV12_VALUE_1ms_FOSC_240000        65535-2000     //2000*12/24000000 = 1 mS,       // Timer divider = 12        
#define    TIMER_DIV12_VALUE_10ms_FOSC_240000       65535-20000    //2000*12/24000000 = 10 mS       // Timer divider = 12       
#define    TIMER_DIV4_VALUE_10us_FOSC_240000        65535-60       //60*4/24000000 = 10 uS,         // Timer divider = 4        
#define    TIMER_DIV4_VALUE_100us_FOSC_240000       65535-600      //600*4/24000000 = 100 us        // Timer divider = 4          
#define    TIMER_DIV4_VALUE_200us_FOSC_240000       65535-1200     //1200*4/24000000 = 200 us       // Timer divider = 4          
#define    TIMER_DIV4_VALUE_500us_FOSC_240000       65535-3000     //3000*4/24000000 = 500 us       // Timer divider = 4          
#define    TIMER_DIV4_VALUE_1ms_FOSC_240000         65535-6000     //6000*4/24000000 = 1 mS,        // Timer divider = 4        
#define    TIMER_DIV4_VALUE_10ms_FOSC_240000        65535-60000    //60000*4/2400000 = 10 ms                                    
#define    TIMER_DIV16_VALUE_10ms_FOSC_240000       65535-15000    //15000*16/24000000 = 10 ms      // Timer divider = 16       
#define    TIMER_DIV64_VALUE_30ms_FOSC_240000       65535-11250    //11250*64/24000000 = 30 ms      // Timer divider = 64       
#define    TIMER_DIV128_VALUE_1ms_FOSC_240000       65535-187      //187*128/24000000 = 1 ms        // Timer divider = 128        
#define    TIMER_DIV128_VALUE_10ms_FOSC_240000      65535-1875     //1875*128/24000000 = 10 ms      // Timer divider = 128       
#define    TIMER_DIV128_VALUE_100ms_FOSC_240000     65535-18750    //18750*128/24000000 = 100 ms    // Timer divider = 128    
#define    TIMER_DIV128_VALUE_200ms_FOSC_240000     65535-37500    //37500*128/24000000 = 200 ms    // Timer divider = 128    
#define    TIMER_DIV256_VALUE_500ms_FOSC_240000     65535-46875    //46875*256/24000000 = 500 ms    // Timer divider = 256   
#define    TIMER_DIV512_VALUE_10ms_FOSC_240000      65535-468      //468*512/24000000 = 100 ms      // Timer divider = 512     
#define    TIMER_DIV512_VALUE_100ms_FOSC_240000     65535-4687     //4687*512/24000000 = 100 ms     // Timer divider = 512     
#define    TIMER_DIV512_VALUE_500ms_FOSC_240000     65535-23437    //4687*512/24000000 = 500 ms     // Timer divider = 512    
#define    TIMER_DIV512_VALUE_1s_FOSC_240000        65535-46875    //46875*512/24000000 = 1 s.      // Timer Divider = 512    

