OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_define_MS51_32K_IAR.h
#define    DISABLE_ADC                        SFRS=0;ADCCON1&=0xFE;AINDIDS0=0;SFRS=2;AINDIDS1=0;SFRS=0;

/* PWM0 trig ADC start define */
#define    PWM0_CH0_FALLINGEDGE_TRIG_ADC      SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_CH2_FALLINGEDGE_TRIG_ADC      SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_CH4_FALLINGEDGE_TRIG_ADC      SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x00;ADCCON1|=0x02
#define    PWM0_CH0_RISINGEDGE_TRIG_ADC       SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CH2_RISINGEDGE_TRIG_ADC       SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CH4_RISINGEDGE_TRIG_ADC       SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x04;ADCCON1|=0x02
#define    PWM0_CH0_CENTRAL_TRIG_ADC          SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_CH2_CENTRAL_TRIG_ADC          SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_CH4_CENTRAL_TRIG_ADC          SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x08;ADCCON1|=0x02
#define    PWM0_CH0_END_TRIG_ADC              SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x00;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM0_CH2_END_TRIG_ADC              SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x10;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
#define    PWM0_CH4_END_TRIG_ADC              SFRS=0;ADCCON0&=0xCF;ADCCON0|=0x20;ADCCON1&=0xF3;ADCCON1|=0x0C;ADCCON1|=0x02
                                              
#define    P04_FALLINGEDGE_TRIG_ADC           SFRS=0;ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=0x02;ADCCON1&=0xBF
#define    P13_FALLINGEDGE_TRIG_ADC           SFRS=0;ADCCON0|=0x30;ADCCON1&=0xF3;ADCCON1|=0x02;ADCCON1|=0x40
#define    P04_RISINGEDGE_TRIG_ADC            SFRS=0;ADCCON0|=0x30;ADCCON1&=0xF7;ADCCON1|=0x04;ADCCON1|=0x02;ADCCON1&=0xBF
#define    P13_RISINGEDGE_TRIG_ADC            SFRS=0;ADCCON0|=0x30;ADCCON1&=0xF7;ADCCON1|=0x04;ADCCON1|=0x02;ADCCON1|=0x40

/*****************************************************************************************
* For SPI INIT setting 
*****************************************************************************************/
#define    SPICLK_FSYS_DIV2                        SFRS=0;SPCR&=0xFC;SPCR|=0x00           
#define    SPICLK_FSYS_DIV4                        SFRS=0;SPCR&=0xFC;SPCR|=0x01           
#define    SPICLK_FSYS_DIV8                        SFRS=0;SPCR&=0xFC;SPCR|=0x02           
#define    SPICLK_FSYS_DIV16                       SFRS=0;SPCR&=0xFC;SPCR|=0x03           

#define    ENABLE_SPI0_SS_P15                 clr_AUXR7_SPI0NSSP1;clr_AUXR7_SPI0NSSP0;SFRS=0
#define    ENABLE_SPI0_SS_P35                 set_AUXR7_SPI0NSSP1;clr_AUXR7_SPI0NSSP0;SFRS=0
#define    ENABLE_SPI0_MOSI_P00               clr_AUXR7_SPI0MOSIP                    ;SFRS=0
#define    ENABLE_SPI0_MOSI_P30               set_AUXR7_SPI0MOSIP                    ;SFRS=0
#define    ENABLE_SPI0_MISO_P01               clr_AUXR7_SPI0MISOP                    ;SFRS=0
#define    ENABLE_SPI0_MISO_P25               set_AUXR7_SPI0MISOP                    ;SFRS=0
#define    ENABLE_SPI0_CLK_P10                clr_AUXR7_SPI0CKP                      ;SFRS=0
#define    ENABLE_SPI0_CLK_P17                set_AUXR7_SPI0CKP                      ;SFRS=0

/*****************************************************************************************
* For UART0 and UART1 and printf funcion 
*****************************************************************************************/
#define    ENABLE_UART0_PRINTF                set_SCON_TI;PRINTFG=1            //For printf function must setting TI = 1
#define    DISABLE_UART0_PRINTF               clr_SCON_TI;PRINTFG=0
#define    ENABLE_UART1_PRINTF                set_SCON_1_TI_1;PRINTFG=1
#define    DISABLE_UART1_PRINTF               clr_SCON_1_TI_1;PRINTFG=0

/*****************************************************************************************/
/* For UART2 ~ UART4 output setting                                                      */
/*****************************************************************************************/
#define    ENABLE_UART2_TXD_P03          clr_AUXR2_UART2TXP1;set_AUXR2_UART2TXP0;SFRS=0
#define    ENABLE_UART2_TXD_P30          set_AUXR2_UART2TXP1;clr_AUXR2_UART2TXP0;SFRS=0
#define    ENABLE_UART2_RXD_P04          clr_AUXR2_UART2RXP1;set_AUXR2_UART2RXP0;SFRS=0
#define    ENABLE_UART2_RXD_P17          set_AUXR2_UART2RXP1;clr_AUXR2_UART2RXP0;SFRS=0
                                                                               
#define    ENABLE_UART1_TXD_P16          clr_AUXR2_UART1TXP1;set_AUXR2_UART1TXP0;SFRS=0
#define    ENABLE_UART1_TXD_P36          set_AUXR2_UART1TXP1;clr_AUXR2_UART1TXP0;SFRS=0
#define    ENABLE_UART1_TXD_P10          set_AUXR2_UART1TXP1;set_AUXR2_UART1TXP0;SFRS=0
#define    ENABLE_UART1_RXD_P02          clr_AUXR2_UART1RXP1;set_AUXR2_UART1RXP0;SFRS=0
#define    ENABLE_UART1_RXD_P37          set_AUXR2_UART1RXP1;clr_AUXR2_UART1RXP0;SFRS=0
#define    ENABLE_UART1_RXD_P00          set_AUXR2_UART1RXP1;set_AUXR2_UART1RXP0;SFRS=0
                                                                                
#define    ENABLE_UART4_TXD_P23          clr_AUXR3_UART4TXP1;set_AUXR3_UART4TXP0;SFRS=0
#define    ENABLE_UART4_RXD_P22          clr_AUXR3_UART4RXP1;set_AUXR3_UART4RXP0;SFRS=0
                                                                               
#define    ENABLE_UART3_TXD_P12          clr_AUXR3_UART3TXP1;set_AUXR3_UART3TXP0;SFRS=0
#define    ENABLE_UART3_TXD_P15          set_AUXR3_UART3TXP1;clr_AUXR3_UART3TXP0;SFRS=0
#define    ENABLE_UART3_TXD_P05          set_AUXR3_UART3TXP1;set_AUXR3_UART3TXP0;SFRS=0
#define    ENABLE_UART3_RXD_P11          clr_AUXR3_UART3RXP1;set_AUXR3_UART3RXP0;SFRS=0
#define    ENABLE_UART3_RXD_P25          set_AUXR3_UART3RXP1;clr_AUXR3_UART3RXP0;SFRS=0
#define    ENABLE_UART3_RXD_P34          set_AUXR3_UART3RXP1;set_AUXR3_UART3RXP0;SFRS=0
                                         
#define    ENABLE_UART4_RXD_DEGLITCH     set_AUXR6_UART4DG;SFRS=0
#define    ENABLE_UART3_RXD_DEGLITCH     set_AUXR6_UART3DG;SFRS=0
#define    ENABLE_UART2_RXD_DEGLITCH     set_AUXR6_UART2DG;SFRS=0
#define    ENABLE_UART1_RXD_DEGLITCH     set_AUXR6_UART1DG;SFRS=0
#define    ENABLE_UART0_RXD_DEGLITCH     set_AUXR6_UART0DG;SFRS=0
                                                          
