OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_define_MS51_32K_IAR.h
#define    ENABLE_PIT1_P00_BOTHEDGE          SFRS=2;PIPS1=0x00;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P01_BOTHEDGE          SFRS=2;PIPS1=0x01;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P02_BOTHEDGE          SFRS=2;PIPS1=0x02;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P03_BOTHEDGE          SFRS=2;PIPS1=0x03;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P04_BOTHEDGE          SFRS=2;PIPS1=0x04;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P05_BOTHEDGE          SFRS=2;PIPS1=0x05;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P06_BOTHEDGE          SFRS=2;PIPS1=0x06;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P07_BOTHEDGE          SFRS=2;PIPS1=0x07;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P10_BOTHEDGE          SFRS=2;PIPS1=0x10;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P11_BOTHEDGE          SFRS=2;PIPS1=0x11;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P12_BOTHEDGE          SFRS=2;PIPS1=0x12;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P13_BOTHEDGE          SFRS=2;PIPS1=0x13;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P14_BOTHEDGE          SFRS=2;PIPS1=0x14;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P15_BOTHEDGE          SFRS=2;PIPS1=0x15;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P16_BOTHEDGE          SFRS=2;PIPS1=0x16;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P17_BOTHEDGE          SFRS=2;PIPS1=0x17;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P20_BOTHEDGE          SFRS=2;PIPS1=0x20;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P21_BOTHEDGE          SFRS=2;PIPS1=0x21;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P22_BOTHEDGE          SFRS=2;PIPS1=0x22;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P23_BOTHEDGE          SFRS=2;PIPS1=0x23;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P24_BOTHEDGE          SFRS=2;PIPS1=0x24;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P25_BOTHEDGE          SFRS=2;PIPS1=0x25;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P30_BOTHEDGE          SFRS=2;PIPS1=0x30;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P31_BOTHEDGE          SFRS=2;PIPS1=0x31;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P32_BOTHEDGE          SFRS=2;PIPS1=0x32;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P33_BOTHEDGE          SFRS=2;PIPS1=0x33;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P34_BOTHEDGE          SFRS=2;PIPS1=0x34;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P35_BOTHEDGE          SFRS=2;PIPS1=0x35;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P36_BOTHEDGE          SFRS=2;PIPS1=0x36;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1
#define    ENABLE_PIT1_P37_BOTHEDGE          SFRS=2;PIPS1=0x37;SFRS=0;PICON|=SET_BIT1;PINEN|=SET_BIT1;PIPEN|=SET_BIT1

  /*------- -------- Pin interrupt channel 1 PIT1 Disable ------------------------ */
#define    DISABLE_PIT1_P00_LOWLEVEL         SFRS=2;PIPS1=0x00;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P01_LOWLEVEL         SFRS=2;PIPS1=0x01;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P02_LOWLEVEL         SFRS=2;PIPS1=0x02;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P03_LOWLEVEL         SFRS=2;PIPS1=0x03;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P04_LOWLEVEL         SFRS=2;PIPS1=0x04;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P05_LOWLEVEL         SFRS=2;PIPS1=0x05;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P06_LOWLEVEL         SFRS=2;PIPS1=0x06;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P07_LOWLEVEL         SFRS=2;PIPS1=0x07;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P10_LOWLEVEL         SFRS=2;PIPS1=0x10;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P11_LOWLEVEL         SFRS=2;PIPS1=0x11;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P12_LOWLEVEL         SFRS=2;PIPS1=0x12;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P13_LOWLEVEL         SFRS=2;PIPS1=0x13;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P14_LOWLEVEL         SFRS=2;PIPS1=0x14;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P15_LOWLEVEL         SFRS=2;PIPS1=0x15;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P16_LOWLEVEL         SFRS=2;PIPS1=0x16;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P17_LOWLEVEL         SFRS=2;PIPS1=0x17;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P20_LOWLEVEL         SFRS=2;PIPS1=0x20;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P21_LOWLEVEL         SFRS=2;PIPS1=0x21;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P22_LOWLEVEL         SFRS=2;PIPS1=0x22;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P23_LOWLEVEL         SFRS=2;PIPS1=0x23;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P24_LOWLEVEL         SFRS=2;PIPS1=0x24;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P25_LOWLEVEL         SFRS=2;PIPS1=0x25;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P30_LOWLEVEL         SFRS=2;PIPS1=0x30;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P31_LOWLEVEL         SFRS=2;PIPS1=0x31;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P32_LOWLEVEL         SFRS=2;PIPS1=0x32;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P33_LOWLEVEL         SFRS=2;PIPS1=0x33;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P34_LOWLEVEL         SFRS=2;PIPS1=0x34;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P35_LOWLEVEL         SFRS=2;PIPS1=0x35;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P36_LOWLEVEL         SFRS=2;PIPS1=0x36;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1
#define    DISABLE_PIT1_P37_LOWLEVEL         SFRS=2;PIPS1=0x37;SFRS=0;PICON&=CLR_BIT1;PINEN&=CLR_BIT1;PIPEN&=CLR_BIT1

