OpenNuvoton/MS51BSP_IAR/MS51FC0AE_MS51XC0BE_MS51EB0AE_MS51EC0AE_MS51TC0AE_MS51PC0AE/Library/Device/Include/Function_define_MS51_32K_IAR.h
#define    DISABLE_PIT4_P00_HIGHLEVEL        SFRS=2;PIPS4=0x00;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P01_HIGHLEVEL        SFRS=2;PIPS4=0x01;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P02_HIGHLEVEL        SFRS=2;PIPS4=0x02;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P03_HIGHLEVEL        SFRS=2;PIPS4=0x03;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P04_HIGHLEVEL        SFRS=2;PIPS4=0x04;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P05_HIGHLEVEL        SFRS=2;PIPS4=0x05;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P06_HIGHLEVEL        SFRS=2;PIPS4=0x06;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P07_HIGHLEVEL        SFRS=2;PIPS4=0x07;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P10_HIGHLEVEL        SFRS=2;PIPS4=0x10;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P11_HIGHLEVEL        SFRS=2;PIPS4=0x11;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P12_HIGHLEVEL        SFRS=2;PIPS4=0x12;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P13_HIGHLEVEL        SFRS=2;PIPS4=0x13;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P14_HIGHLEVEL        SFRS=2;PIPS4=0x14;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P15_HIGHLEVEL        SFRS=2;PIPS4=0x15;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P16_HIGHLEVEL        SFRS=2;PIPS4=0x16;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P17_HIGHLEVEL        SFRS=2;PIPS4=0x17;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P20_HIGHLEVEL        SFRS=2;PIPS4=0x20;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P21_HIGHLEVEL        SFRS=2;PIPS4=0x21;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P22_HIGHLEVEL        SFRS=2;PIPS4=0x22;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P23_HIGHLEVEL        SFRS=2;PIPS4=0x23;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P24_HIGHLEVEL        SFRS=2;PIPS4=0x24;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P25_HIGHLEVEL        SFRS=2;PIPS4=0x25;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P30_HIGHLEVEL        SFRS=2;PIPS4=0x30;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P31_HIGHLEVEL        SFRS=2;PIPS4=0x31;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P32_HIGHLEVEL        SFRS=2;PIPS4=0x32;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P33_HIGHLEVEL        SFRS=2;PIPS4=0x33;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P34_HIGHLEVEL        SFRS=2;PIPS4=0x34;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P35_HIGHLEVEL        SFRS=2;PIPS4=0x35;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P36_HIGHLEVEL        SFRS=2;PIPS4=0x36;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P37_HIGHLEVEL        SFRS=2;PIPS4=0x37;SFRS=0;PICON&=CLR_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4

#define    DISABLE_PIT4_P00_FALLINGEDGE      SFRS=2;PIPS4=0x00;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P01_FALLINGEDGE      SFRS=2;PIPS4=0x01;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P02_FALLINGEDGE      SFRS=2;PIPS4=0x02;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P03_FALLINGEDGE      SFRS=2;PIPS4=0x03;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P04_FALLINGEDGE      SFRS=2;PIPS4=0x04;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P05_FALLINGEDGE      SFRS=2;PIPS4=0x05;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P06_FALLINGEDGE      SFRS=2;PIPS4=0x06;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P07_FALLINGEDGE      SFRS=2;PIPS4=0x07;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P10_FALLINGEDGE      SFRS=2;PIPS4=0x10;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P11_FALLINGEDGE      SFRS=2;PIPS4=0x11;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P12_FALLINGEDGE      SFRS=2;PIPS4=0x12;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P13_FALLINGEDGE      SFRS=2;PIPS4=0x13;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P14_FALLINGEDGE      SFRS=2;PIPS4=0x14;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P15_FALLINGEDGE      SFRS=2;PIPS4=0x15;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P16_FALLINGEDGE      SFRS=2;PIPS4=0x16;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P17_FALLINGEDGE      SFRS=2;PIPS4=0x17;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P20_FALLINGEDGE      SFRS=2;PIPS4=0x20;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P21_FALLINGEDGE      SFRS=2;PIPS4=0x21;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P22_FALLINGEDGE      SFRS=2;PIPS4=0x22;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P23_FALLINGEDGE      SFRS=2;PIPS4=0x23;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P24_FALLINGEDGE      SFRS=2;PIPS4=0x24;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P25_FALLINGEDGE      SFRS=2;PIPS4=0x25;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P30_FALLINGEDGE      SFRS=2;PIPS4=0x30;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P31_FALLINGEDGE      SFRS=2;PIPS4=0x31;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P32_FALLINGEDGE      SFRS=2;PIPS4=0x32;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P33_FALLINGEDGE      SFRS=2;PIPS4=0x33;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P34_FALLINGEDGE      SFRS=2;PIPS4=0x34;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P35_FALLINGEDGE      SFRS=2;PIPS4=0x35;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P36_FALLINGEDGE      SFRS=2;PIPS4=0x36;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P37_FALLINGEDGE      SFRS=2;PIPS4=0x37;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4

#define    DISABLE_PIT4_P00_RISINGEDGE       SFRS=2;PIPS4=0x00;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P01_RISINGEDGE       SFRS=2;PIPS4=0x01;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P02_RISINGEDGE       SFRS=2;PIPS4=0x02;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P03_RISINGEDGE       SFRS=2;PIPS4=0x03;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P04_RISINGEDGE       SFRS=2;PIPS4=0x04;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P05_RISINGEDGE       SFRS=2;PIPS4=0x05;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P06_RISINGEDGE       SFRS=2;PIPS4=0x06;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P07_RISINGEDGE       SFRS=2;PIPS4=0x07;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P10_RISINGEDGE       SFRS=2;PIPS4=0x10;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P11_RISINGEDGE       SFRS=2;PIPS4=0x11;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P12_RISINGEDGE       SFRS=2;PIPS4=0x12;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P13_RISINGEDGE       SFRS=2;PIPS4=0x13;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P14_RISINGEDGE       SFRS=2;PIPS4=0x14;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P15_RISINGEDGE       SFRS=2;PIPS4=0x15;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P16_RISINGEDGE       SFRS=2;PIPS4=0x16;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P17_RISINGEDGE       SFRS=2;PIPS4=0x17;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P20_RISINGEDGE       SFRS=2;PIPS4=0x20;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P21_RISINGEDGE       SFRS=2;PIPS4=0x21;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P22_RISINGEDGE       SFRS=2;PIPS4=0x22;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P23_RISINGEDGE       SFRS=2;PIPS4=0x23;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P24_RISINGEDGE       SFRS=2;PIPS4=0x24;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P25_RISINGEDGE       SFRS=2;PIPS4=0x25;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P30_RISINGEDGE       SFRS=2;PIPS4=0x30;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P31_RISINGEDGE       SFRS=2;PIPS4=0x31;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P32_RISINGEDGE       SFRS=2;PIPS4=0x32;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P33_RISINGEDGE       SFRS=2;PIPS4=0x33;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P34_RISINGEDGE       SFRS=2;PIPS4=0x34;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P35_RISINGEDGE       SFRS=2;PIPS4=0x35;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P36_RISINGEDGE       SFRS=2;PIPS4=0x36;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P37_RISINGEDGE       SFRS=2;PIPS4=0x37;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4

#define    DISABLE_PIT4_P00_BOTHEDGE         SFRS=2;PIPS4=0x00;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P01_BOTHEDGE         SFRS=2;PIPS4=0x01;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P02_BOTHEDGE         SFRS=2;PIPS4=0x02;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P03_BOTHEDGE         SFRS=2;PIPS4=0x03;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P04_BOTHEDGE         SFRS=2;PIPS4=0x04;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P05_BOTHEDGE         SFRS=2;PIPS4=0x05;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P06_BOTHEDGE         SFRS=2;PIPS4=0x06;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P07_BOTHEDGE         SFRS=2;PIPS4=0x07;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P10_BOTHEDGE         SFRS=2;PIPS4=0x10;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P11_BOTHEDGE         SFRS=2;PIPS4=0x11;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P12_BOTHEDGE         SFRS=2;PIPS4=0x12;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P13_BOTHEDGE         SFRS=2;PIPS4=0x13;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P14_BOTHEDGE         SFRS=2;PIPS4=0x14;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P15_BOTHEDGE         SFRS=2;PIPS4=0x15;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P16_BOTHEDGE         SFRS=2;PIPS4=0x16;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P17_BOTHEDGE         SFRS=2;PIPS4=0x17;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P20_BOTHEDGE         SFRS=2;PIPS4=0x20;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P21_BOTHEDGE         SFRS=2;PIPS4=0x21;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P22_BOTHEDGE         SFRS=2;PIPS4=0x22;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P23_BOTHEDGE         SFRS=2;PIPS4=0x23;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P24_BOTHEDGE         SFRS=2;PIPS4=0x24;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P25_BOTHEDGE         SFRS=2;PIPS4=0x25;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P30_BOTHEDGE         SFRS=2;PIPS4=0x30;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P31_BOTHEDGE         SFRS=2;PIPS4=0x31;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P32_BOTHEDGE         SFRS=2;PIPS4=0x32;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P33_BOTHEDGE         SFRS=2;PIPS4=0x33;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P34_BOTHEDGE         SFRS=2;PIPS4=0x34;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P35_BOTHEDGE         SFRS=2;PIPS4=0x35;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P36_BOTHEDGE         SFRS=2;PIPS4=0x36;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4
#define    DISABLE_PIT4_P37_BOTHEDGE         SFRS=2;PIPS4=0x37;SFRS=0;PICON|=SET_BIT4;PINEN&=CLR_BIT4;PIPEN&=CLR_BIT4

